app/Controllers/Dashboard.php

SELECT *
FROM `informasi`
WHERE `informasi`.`id` = '40'
DELETE FROM `informasi`
WHERE `id` IN ('40')
---
    public function delete($id)
    {
        $infoModel = new InformasiModel();

        // Cek apakah berita dengan ID tersebut ada
        $newsItem = $infoModel->find($id);
        if ($newsItem) {
            // Jika ada file thumbnail terkait, hapus dari server
            if (!empty($newsItem['thumbnail'])) {
                $filePath = '../publi/assets/lib/images/' . $newsItem['thumbnail'];
                print_r($filePath);
                // Cek apakah file ada dan hapus
                if (file_exists($filePath)) {
                    unlink($filePath); // Hapus file dari server
                    print_r(time());
                }
            }

            // Hapus berita dari database
            $infoModel->delete($id);