app/Models/InformasiModel.php

SELECT `informasi`.*, `kategori`.`nama_kategori`
FROM `informasi`
JOIN `kategori` ON `kategori`.`id` = `informasi`.`kategori_id`
WHERE `informasi`.`slug` = 'sukseskan-pilkada-2024-seluruh-asn-pemkab-intan-jaya-dilarang-keras-terlibat-politik-praktis'
---
    public function getNewsBySlug($slug)
    {
        $builder = $this->db->table('informasi');
        $builder->select('informasi.*, kategori.nama_kategori');
        $builder->join('kategori', 'kategori.id = informasi.kategori_id');
        $builder->where('informasi.slug', $slug); // Add the condition to filter by slug
        return $builder->get()->getRow(); // getRow() will return a single row instead of an array of results