app/Models/InformasiModel.php

SELECT `informasi`.*, `kategori`.`nama_kategori`
FROM `informasi`
JOIN `kategori` ON `kategori`.`id` = `informasi`.`kategori_id`
ORDER BY `informasi`.`id` DESC
---
    public function getAllInfo()
    {
        $builder = $this->db->table('informasi');
        $builder->select('informasi.*, kategori.nama_kategori');
        $builder->join('kategori', 'kategori.id = informasi.kategori_id');
        $builder->orderBy('informasi.id', 'DESC');
        return $builder->get()->getResult();

SELECT `informasi`.*, `kategori`.`nama_kategori`
FROM `informasi`
JOIN `kategori` ON `kategori`.`id` = `informasi`.`kategori_id`
WHERE `kategori`.`id` = 1
ORDER BY `informasi`.`id` DESC
---
    public function getBerita()
    {
        $builder = $this->db->table('informasi');
        $builder->select('informasi.*, kategori.nama_kategori');
        $builder->join('kategori', 'kategori.id = informasi.kategori_id');
        $builder->where('kategori.id', 1); // Filter by category id
        $builder->orderBy('informasi.id', 'DESC');
        return $builder->get()->getResult();

SELECT `informasi`.*, `kategori`.`nama_kategori`
FROM `informasi`
JOIN `kategori` ON `kategori`.`id` = `informasi`.`kategori_id`
WHERE `kategori`.`id` = 3
ORDER BY `informasi`.`id` DESC
---
    public function getLayananPublik()
    {
        $builder = $this->db->table('informasi');
        $builder->select('informasi.*, kategori.nama_kategori');
        $builder->join('kategori', 'kategori.id = informasi.kategori_id');
        $builder->where('kategori.id', 3); // Filter by category id
        $builder->orderBy('informasi.id', 'DESC');
        return $builder->get()->getResult();

SELECT `informasi`.*, `kategori`.`nama_kategori`
FROM `informasi`
JOIN `kategori` ON `kategori`.`id` = `informasi`.`kategori_id`
WHERE `kategori`.`id` = 4
ORDER BY `informasi`.`id` DESC
---
    public function getDocumentPublik()
    {
        $builder = $this->db->table('informasi');
        $builder->select('informasi.*, kategori.nama_kategori');
        $builder->join('kategori', 'kategori.id = informasi.kategori_id');
        $builder->where('kategori.id', 4); // Filter by category id
        $builder->orderBy('informasi.id', 'DESC');
        return $builder->get()->getResult();

SELECT `informasi`.*, `kategori`.`nama_kategori`
FROM `informasi`
JOIN `kategori` ON `kategori`.`id` = `informasi`.`kategori_id`
WHERE `kategori`.`id` = 6
ORDER BY `informasi`.`id` DESC
---
    public function getPengumuman()
    {
        $builder = $this->db->table('informasi');
        $builder->select('informasi.*, kategori.nama_kategori');
        $builder->join('kategori', 'kategori.id = informasi.kategori_id');
        $builder->where('kategori.id', 6); // Filter by category id
        $builder->orderBy('informasi.id', 'DESC');
        return $builder->get()->getResult();