app/Models/KategoriModel.php

SELECT *
FROM `kategori`
---
    public function getAllKategori()
    {
        return $this->findAll();