app/Models/NewsModel.php

SELECT *
FROM `news`
---
    public function getAllNews()
    {
        return $this->findAll();

SELECT *
FROM `news`
WHERE `slug` = 'qui-suscipit-nostrum-fuga-fugiat'
 LIMIT 1
---
    public function getNewsBySlug($slug)
    {
        return $this->where('slug', $slug)->first();